refactor: restructure esmos-monitor and esmos-monitor-trigger as a monorepo
